results/wss/a3_latency.txt
=== a3_latency: 延迟分布 (带详细分位) ===
分支: feature/WebSocket
时间: 2026-05-30T16:44:36+08:00
---
Running 30s test @ http://localhost:18980/bench/json
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    41.73ms  208.91ms   1.76s    96.21%
    Req/Sec     8.71k   653.73    10.21k    87.29%
  Latency Distribution
     50%    2.56ms
     75%    4.79ms
     90%    7.98ms
     99%    1.36s 
  1045018 requests in 31.78s, 176.40MB read
  Socket errors: connect 0, read 1045419, write 0, timeout 0
Requests/sec:  32881.23
Transfer/sec:      5.55MB