results/wss/a3_latency.txt
=== a3_latency: 延迟分布 (带详细分位) ===
分支: feature/WebSocket
时间: 2026-09-21T03:23:00+08:00
环境: 2 vCPU / 1968 MB / Linux 6.8.0-90-generic
环境-CPU: Intel(R) Xeon(R) Gold 6148 CPU @ 2.40GHz × 2
环境-gcc: g++ (Ubuntu 13.3.0-6ubuntu2~24.04) 13.3.0
环境-git-HEAD: cd2d29383cc91dc9d2c5ad5092bbe96b4c884aea
环境-wrk: wrk 4.2.0 [epoll] Copyright (C) 2012 Will Glozer
环境-governor: 不可读（固定失败：sysfs 无 cpufreq 驱动（虚拟机/容器常见）；已尝试 cpupower frequency-set -g performance，无效）
环境-记录时间: 2026-09-21T03:23:00+08:00
说明: 压测端与被测服务同机（环回），服务线程数见各项 --threads，wrk 线程数 -t2
---
Running 30s test @ http://localhost:18980/bench/json
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.42ms    0.98ms  27.67ms   75.46%
    Req/Sec    20.13k     1.96k   25.43k    64.50%
  Latency Distribution
     50%    2.32ms
     75%    2.91ms
     90%    3.55ms
     99%    5.22ms
  1202345 requests in 30.02s, 230.48MB read
Requests/sec:  40047.95
Transfer/sec:      7.68MB