results/wss/a3_latency.txt
=== a3_latency: 延迟分布 (带详细分位) ===
分支: feature/WebSocket
时间: 2026-09-20T22:30:06+08:00
环境: 2 vCPU / 1968 MB / Linux 6.8.0-90-generic
环境-CPU: Intel(R) Xeon(R) Gold 6148 CPU @ 2.40GHz × 2
环境-gcc: g++ (Ubuntu 13.3.0-6ubuntu2~24.04) 13.3.0
环境-git-HEAD: d3720d7921cba6d5a5dabb56304c4f6b2ccda619
环境-wrk: wrk 4.2.0 [epoll] Copyright (C) 2012 Will Glozer
环境-governor: 不可读（固定失败：sysfs 无 cpufreq 驱动（虚拟机/容器常见）；已尝试 cpupower frequency-set -g performance，无效）
环境-记录时间: 2026-09-20T22:30:06+08:00
说明: 压测端与被测服务同机（环回），服务线程数见各项 --threads，wrk 线程数 -t2
---
Running 30s test @ http://localhost:18980/bench/json
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.59ms    1.05ms  25.69ms   75.22%
    Req/Sec    18.94k     2.25k   25.32k    71.33%
  Latency Distribution
     50%    2.48ms
     75%    3.11ms
     90%    3.79ms
     99%    5.73ms
  1131429 requests in 30.02s, 216.88MB read
Requests/sec:  37684.94
Transfer/sec:      7.22MB